tap "homebrew/bundle"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Lightweight and flexible command-line JSON processor
brew "jq"
# File browser
brew "ranger"
# Command-line Interface for Scaleway
brew "scw"
# YAML Parser
brew "libyaml"
# Python version management
brew "pyenv"
# Next-generation plugin manager for zsh
brew "zplug"
# Command-line fuzzy finder written in Go
brew "fzf"
# UNIX shell (command interpreter)
brew "zsh"
# Port scanning utility for large networks
brew "nmap"
# User interface to the TELNET protocol
brew "telnet"
# Terminal emulator
cask "iterm2"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Native desktop client for WhatsApp
cask "whatsapp"
# Online diagram software
cask "drawio"
# Tools for building Android applications
cask "android-studio"
# Collaborative design tool for building meaningful products
cask "figma"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# App to write, plan, collaborate, and get organised
cask "notion"
# Platform for API development
cask "postman"
# A launcher of powerful productivity tools
cask "raycast"
# To-do list
cask "todoist"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# Java IDE by JetBrains
cask "intellij-idea"
# Multimedia player
cask "vlc"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
brew "docker-completion"
# Web browser
cask "firefox"
# Support for Logitech G gear
cask "logitech-g-hub"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Unofficial app for Yandex Music
cask "yandex-music"
# Video communication and virtual meeting platform
cask "zoom"

mas "WireGuard", id: 1451685025
mas "Delete Apps", id: 1033808943
