tap "homebrew/bundle"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Lightweight and flexible command-line JSON processor
brew "jq"
# File browser
brew "ranger"
# Command-line Interface for Scaleway
brew "scw"
# YAML Parser
brew "libyaml"
# Python version management
brew "pyenv"
# Next-generation plugin manager for zsh
brew "zplug"
# Command-line fuzzy finder written in Go
brew "fzf"
# UNIX shell (command interpreter)
brew "zsh"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Terminal built on web technologies
cask "hyper"
# Support for Logitech G gear
cask "logitech-g-hub"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Unofficial app for Yandex Music
cask "yandex-music"
# Video communication and virtual meeting platform
cask "zoom"
mas "HazeOver", id: 430798174
mas "Delete Apps", id: 1033808943
